In [7]:
import pandas as pd
pop = pd.Series({"california":32567,
      "texas":45673,
      "nebraska":90347,
      "sudbury":67348,
      "novascotia":78349})

In [8]:
gdp = pd.Series({ "california":90,
      "texas":99,
      "nebraska":77,
      "sudbury":94,
      "novascotia":88})

In [34]:
df1 = pd.DataFrame({"population":pop,"gdp":gdp})
df1

            population  gdp
california       32567   90
texas            45673   99
nebraska         90347   77
sudbury          67348   94
novascotia       78349   88

In [36]:
df1["ethnicity"] = ["american","american","african","canadian","canadian"]

In [37]:
type(df1["ethnicity"])

pandas.core.series.Series

In [22]:
df1

            population  gdp ethnicity
california       32567   90  american
texas            45673   99  american
nebraska         90347   77   african
sudbury          67348   94  canadian
novascotia       78349   88  canadian

In [23]:
df1.index

Index(['california', 'texas', 'nebraska', 'sudbury', 'novascotia'], dtype='object')

In [24]:
df1.values

array([[32567, 90, 'american'],
       [45673, 99, 'american'],
       [90347, 77, 'african'],
       [67348, 94, 'canadian'],
       [78349, 88, 'canadian']], dtype=object)

In [38]:
df1["gdp"]

california    90
texas         99
nebraska      77
sudbury       94
novascotia    88
Name: gdp, dtype: int64

In [27]:
df1[["gdp","population"]]

            gdp  population
california   90       32567
texas        99       45673
nebraska     77       90347
sudbury      94       67348
novascotia   88       78349

In [28]:
df1.columns

Index(['population', 'gdp', 'ethnicity'], dtype='object')

In [29]:
"texas" in df1

False

In [42]:
df1["gdp"]["nebraska"] = 80

/tmp/ipykernel_3102/936545055.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["gdp"]["nebraska"] = 80

In [43]:
df1

            population  gdp ethnicity
california       32567   90  american
texas            45673   99  american
nebraska         90347   80   african
sudbury          67348   94  canadian
novascotia       78349   88  canadian

In [44]:
df1.keys()

Index(['population', 'gdp', 'ethnicity'], dtype='object')

In [45]:
df1.items()

In [48]:
df1.T

           california     texas nebraska   sudbury novascotia
population      32567     45673    90347     67348      78349
gdp                90        99       80        94         88
ethnicity    american  american  african  canadian   canadian

In [49]:
df1.values[0]

array([32567, 90, 'american'], dtype=object)

In [50]:
df1

            population  gdp ethnicity
california       32567   90  american
texas            45673   99  american
nebraska         90347   80   african
sudbury          67348   94  canadian
novascotia       78349   88  canadian

In [52]:
df1.values[1]

array([45673, 99, 'american'], dtype=object)

In [53]:
df1.index

Index(['california', 'texas', 'nebraska', 'sudbury', 'novascotia'], dtype='object')

In [54]:
df1.iloc[:3]

            population  gdp ethnicity
california       32567   90  american
texas            45673   99  american
nebraska         90347   80   african

In [55]:
df1.iloc[3]

population       67348
gdp                 94
ethnicity     canadian
Name: sudbury, dtype: object

In [56]:
df1.iloc[0]

population       32567
gdp                 90
ethnicity     american
Name: california, dtype: object

In [57]:
df1.iloc[1]

population       45673
gdp                 99
ethnicity     american
Name: texas, dtype: object

In [58]:
df1.iloc[2]

population      90347
gdp                80
ethnicity     african
Name: nebraska, dtype: object

In [59]:
df1.iloc[:3]

            population  gdp ethnicity
california       32567   90  american
texas            45673   99  american
nebraska         90347   80   african

In [60]:
df1.iloc[0,0]

32567

In [61]:
df1.iloc[0,:]

population       32567
gdp                 90
ethnicity     american
Name: california, dtype: object

In [62]:
df1.iloc[:3,:2]

            population  gdp
california       32567   90
texas            45673   99
nebraska         90347   80

In [63]:
df1.iloc[:2,:2]

            population  gdp
california       32567   90
texas            45673   99

In [64]:
df1.loc["texas"]

population       45673
gdp                 99
ethnicity     american
Name: texas, dtype: object

In [66]:
df1.loc["texas":"nebraska"]

          population  gdp ethnicity
texas          45673   99  american
nebraska       90347   80   african

In [67]:
df1.gdp

california    90
texas         99
nebraska      80
sudbury       94
novascotia    88
Name: gdp, dtype: int64

In [68]:
df1.loc[df1.gdp>80]

            population  gdp ethnicity
california       32567   90  american
texas            45673   99  american
sudbury          67348   94  canadian
novascotia       78349   88  canadian

In [71]:
df1.loc[(df1.gdp>80) & (df1.ethnicity == "canadian")]

            population  gdp ethnicity
sudbury          67348   94  canadian
novascotia       78349   88  canadian